laravel-dba/app/Http/Controllers/StudentController.php

    public function index()
    {
        //get all students inside database
        $students = Student::all();
---
select * from `students`